<template>
  <article class="feed-item">
    <div class="feed-item-header">
      <img class="feed-item-header__profile-photo" src="../../assets/img/profile-photo.png" alt="profile-photo">
      <div class="feed-item-header__info">
        <span>Ралец Катерина</span>
        <span>Рентгенолог</span>
      </div>
      <span class="feed-item-header__post-date">28 ноября 2020 в 11:47</span>
      <svg width="7" height="24" viewBox="0 0 7 24" fill="none" xmlns="http://www.w3.org/2000/svg">
        <ellipse cx="3.04129" cy="3" rx="2.99539" ry="3" fill="#4154FF"/>
        <ellipse cx="3.04129" cy="12" rx="2.99539" ry="3" fill="#4154FF"/>
        <ellipse cx="3.04129" cy="21" rx="2.99539" ry="3" fill="#4154FF"/>
      </svg>
    </div>
    <div class="feed-item__content">
      <div class="feed-item__content-img-wrapper">
        <img class="feed-item__content-img" src="../../assets/img/lungs.png" alt="feed-img">
      </div>
      <h2 class="feed-item__content-title">Остеомиелит у детей: от проявления, диагностики и патогенов к лечению</h2>
      <p class="feed-item__content-subtitle">Остеомиелит, наиболее распространенная скелетно-мышечная инфекция у детей,
        как правило, проявляется болью и хромать. Из-за увеличения микротравм у мужчин преобладает мужской состав.
        Инфекция доходит до кости либо ...</p>
      <div class="feed-item__content-actions-btns">
        <button class="feed-item__action-btn">
          <svg width="28" height="25" viewBox="0 0 28 25" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
                d="M9.22252 0.000203503C10.0502 0.0254132 10.8516 0.170148 11.628 0.434617H11.7055C11.758 0.459617 11.7975 0.487248 11.8237 0.512247C12.1141 0.605667 12.3886 0.710928 12.6514 0.855663L13.1506 1.07934C13.3477 1.1846 13.5842 1.38065 13.7155 1.46092C13.8469 1.53855 13.9914 1.61881 14.1097 1.7096C15.5692 0.592509 17.3415 -0.0127441 19.1676 0.000203503C19.9966 0.000203503 20.8242 0.117517 21.6111 0.381986C26.4602 1.96091 28.2075 7.28977 26.7479 11.9476C25.9202 14.3278 24.5671 16.5001 22.7948 18.2751C20.258 20.7356 17.4742 22.9198 14.4775 24.8013L14.1491 25L13.8075 24.7882C10.8003 22.9198 8.00073 20.7356 5.44024 18.262C3.67982 16.487 2.32535 14.3278 1.48455 11.9476C1.72853e-05 7.28977 1.7473 1.96091 6.64889 0.354355C7.02987 0.222778 7.42269 0.130675 7.81681 0.0793597H7.97446C8.34362 0.0254132 8.71016 0.000203503 9.07801 0.000203503H9.22252ZM20.928 4.15824C20.3894 3.97272 19.7982 4.2635 19.6011 4.81612C19.4172 5.36875 19.7062 5.974 20.258 6.17005C21.1001 6.48583 21.6637 7.31608 21.6637 8.2358V8.27659C21.6387 8.5779 21.7294 8.86869 21.9133 9.09237C22.0972 9.31605 22.3731 9.44631 22.6621 9.47394C23.2008 9.45947 23.6606 9.02658 23.7 8.47264V8.31606C23.7394 6.47267 22.624 4.80297 20.928 4.15824Z"
                fill="#FF4141"/>
          </svg>
        </button>
        <span>23</span>
        <button class="feed-item__action-btn">
          <svg width="29" height="25" viewBox="0 0 29 25" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd"
                  d="M14.4338 4.46429C9.11785 4.46429 4.62744 7.32679 4.62744 10.7143C4.62744 10.9607 4.82713 11.1607 5.07318 11.1607C5.31923 11.1607 5.51893 10.9607 5.51893 10.7143C5.51893 7.86072 9.68484 5.35715 14.4338 5.35715C14.6789 5.35715 14.8795 5.15715 14.8795 4.91072C14.8795 4.66429 14.6798 4.46429 14.4338 4.46429Z"
                  fill="#4154FF"/>
            <path fill-rule="evenodd" clip-rule="evenodd"
                  d="M14.4342 0C6.55612 0 0.17041 4.79732 0.17041 10.7143C0.17041 14.3991 2.64785 17.6482 6.41794 19.5768C6.41794 19.6009 6.41081 19.617 6.41081 19.6429C6.41081 21.2437 5.21711 22.967 4.69203 23.8714C4.69292 23.8714 4.69381 23.8714 4.69381 23.8714C4.65191 23.9696 4.62784 24.0777 4.62784 24.1911C4.62784 24.6375 4.98889 25 5.43552 25C5.51932 25 5.66642 24.9777 5.66285 24.9875C8.44875 24.5304 11.0733 21.967 11.6831 21.2241C12.5736 21.3554 13.4919 21.4286 14.4342 21.4286C22.3105 21.4286 28.698 16.6313 28.698 10.7143C28.698 4.79732 22.3113 0 14.4342 0ZM14.4342 19.6429C13.6167 19.6429 12.7778 19.5804 11.9416 19.458C11.8551 19.4437 11.7686 19.4393 11.6831 19.4393C11.1535 19.4393 10.6463 19.675 10.3048 20.0911C9.92326 20.5562 8.83743 21.5946 7.55459 22.358C7.90227 21.5589 8.17417 20.6634 8.19289 19.7402C8.19824 19.683 8.20091 19.625 8.20091 19.5759C8.20091 18.9045 7.8256 18.2911 7.22919 17.9857C3.92535 16.2964 1.95338 13.5777 1.95338 10.7143C1.95338 5.79107 7.55191 1.78571 14.4342 1.78571C21.3147 1.78571 26.915 5.79107 26.915 10.7143C26.915 15.6375 21.3156 19.6429 14.4342 19.6429Z"
                  fill="#4154FF"/>
          </svg>
        </button>
        <span>3</span>
        <button class="feed-item__action-btn">
          <svg width="30" height="25" viewBox="0 0 30 25" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
                d="M1.5819 24.9896C1.48322 25.0035 1.38309 25.0035 1.28441 24.9896C1.08399 24.9245 0.910552 24.795 0.790878 24.6213C0.671204 24.4476 0.611942 24.2393 0.622241 24.0285V23.0674C0.622621 18.7241 2.16859 14.5232 4.98267 11.2186C7.79675 7.91403 11.6947 5.72215 15.9769 5.03637V0.961141C15.9769 0.782645 16.0265 0.607676 16.1202 0.455839C16.2139 0.304002 16.3479 0.181296 16.5073 0.101471C16.6668 0.0216451 16.8452 -0.0121457 17.0227 0.00388413C17.2002 0.019914 17.3697 0.0851314 17.5123 0.192228L29.0283 8.84249C29.1475 8.93202 29.2442 9.04811 29.3108 9.18157C29.3775 9.31503 29.4121 9.46219 29.4121 9.6114C29.4121 9.76061 29.3775 9.90777 29.3108 10.0412C29.2442 10.1747 29.1475 10.2908 29.0283 10.3803L17.5123 19.0306C17.3697 19.1377 17.2002 19.2029 17.0227 19.2189C16.8452 19.2349 16.6668 19.2012 16.5073 19.1213C16.3479 19.0415 16.2139 18.9188 16.1202 18.767C16.0265 18.6151 15.9769 18.4402 15.9769 18.2617V14.6574C11.3298 15.417 7.16846 17.9791 4.39372 21.789L2.35923 24.5956C2.26989 24.718 2.15289 24.8176 2.01779 24.886C1.88269 24.9545 1.73333 24.99 1.5819 24.9896ZM17.8962 2.88342V5.88218C17.8976 6.11979 17.8111 6.3495 17.6534 6.527C17.4957 6.7045 17.2779 6.81718 17.0421 6.84332C13.4235 7.23871 10.0409 8.83477 7.43244 11.3776C4.82399 13.9204 3.13955 17.2638 2.64713 20.876L2.80068 20.6741C4.44291 18.4157 6.54208 16.5294 8.96125 15.1383C11.3804 13.7472 14.0652 12.8824 16.8406 12.6005C16.9743 12.5881 17.1092 12.6039 17.2365 12.6469C17.3638 12.69 17.4807 12.7593 17.5795 12.8504C17.6789 12.9403 17.7584 13.05 17.813 13.1725C17.8675 13.295 17.8959 13.4276 17.8962 13.5617V16.3394L26.8498 9.6114L17.8962 2.88342Z"
                fill="#484848"/>
          </svg>
        </button>
      </div>
    </div>
  </article>
</template>

<script>
export default {
    name: "FeedItem"
}
</script>

<style scoped lang="sass">
.feed-item
    width: 650px
    background-color: #fff
    box-shadow: 2px 2px 8px 0 rgba(0, 0, 0, 0.25)
    margin-top: 20px
    padding: 20px
    border-radius: 5px

.feed-item-header
    display: flex
    align-items: center

.feed-item-header__profile-photo
    width: 60px

.feed-item-header__info
    display: flex
    flex-direction: column
    margin-left: 10px

    span:first-child
        font-size: 18px

    span:last-child
        font-size: 12px
        font-weight: 300

.feed-item-header__post-date
    font-size: 10px
    margin-left: auto
    margin-right: 12px

.feed-item__content-img-wrapper
    display: flex
    justify-content: center
    margin-bottom: 23px
    margin-top: 13px

.feed-item__content-img
    max-height: 224px
    margin: 0 auto

.feed-item__content-title
    font-size: 18px
    font-weight: 700
    margin-bottom: 12px

.feed-item__content-subtitle
  font-size: 14px

.feed-item__content-actions-btns
  margin-top: 20px
  display: flex
  align-items: center

  span
    font-size: 18px
    margin-right: 21px

.feed-item__action-btn
  margin-right: 8px
</style>