<template>
    <div class="page-container">
       <p>
           Пользовательское Соглашение<br>
           Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между ООО "Хилерс" (далее healers или Администрация) с одной стороны и пользователем сайта с другой.<br>
           Сайт healers является средством массовой информации.<br>
           <br>
           Используя сайт, Вы соглашаетесь с условиями данного соглашения.<br>
           Если Вы не согласны с условиями данного соглашения, не используйте сайт healers!<br>
           <br>
           Предмет соглашения<br>
           Администрация предоставляет пользователю право на размещение на сайте следующей информации:<br>
           <br>
           Предмет соглашения<br>
           Администрация предоставляет пользователю право на размещение на сайте следующей информации:<br>
           - Текстовой информации<br>
           - Аудиоматериалов<br>
           - Видеоматериалов<br>
           - Фотоматериалов<br>
           - Ссылок на материалы, размещенные на других сайтах<br>
           <br>
           Права и обязанности сторон<br>
           Пользователь имеет право:<br>
           - осуществлять поиск информации на сайте<br>
           - получать информацию на сайте<br>
           - создавать информацию для сайта<br>
           - распространять информацию на сайте<br>
           - комментировать контент, выложенный на сайте<br>
           - копировать информацию на другие сайты с указанием источника<br>
           - копировать информацию на другие сайты с разрешения правообладателя<br>
           - использовать информацию сайта в личных некоммерческих целях<br>
           - использовать информацию сайта в коммерческих целях с разрешения Администрации<br>
           - использовать информацию сайта в коммерческих целях с разрешения правообладателей<br>
           <br>
           Администрация имеет право:<br>
           - по своему усмотрению и необходимости создавать, изменять, отменять правила<br>
           - ограничивать доступ к любой информации на сайте<br>
           - создавать, изменять, удалять информацию<br>
           - удалять учетные записи<br>
           - отказывать в регистрации без объяснения причин<br>
           <br>
           Пользователь обязуется:<br>
           - обеспечить достоверность предоставляемой информации<br>
           - обеспечивать сохранность личных данных от доступа третьих лиц<br>
           - обновлять Персональные данные, предоставленные при регистрации, в случае их изменения<br>
           - не распространять информацию, которая направлена на пропаганду войны, разжигание национальной, расовой или религиозной ненависти и вражды, а также иной информации, за распространение которой предусмотрена уголовная или административная ответственность<br>
           - не нарушать работоспособность сайта<br>
           - не создавать несколько учётных записей на Сайте, если фактически они принадлежат одному и тому же лицу<br>
           - не совершать действия, направленные на введение других Пользователей в заблуждение<br>
           - не передавать в пользование свою учетную запись и/или логин и пароль своей учетной записи третьим лицам<br>
           - не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами<br>
           <br>
           Администрация обязуется:<br>
           - поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.<br>
           - осуществлять разностороннюю защиту учетной записи Пользователя<br>
           - защищать информацию, распространение которой ограничено или запрещено законами путем вынесения предупреждения либо удалением учетной записи пользователя, нарушившего правила<br>
           <br>
           Ответственность сторон<br>
           - пользователь лично несет полную ответственность за распространяемую им информацию<br>
           - администрация не несет никакой ответственности за достоверность информации, скопированной из других источников<br>
           - администрация не несёт ответственность за несовпадение ожидаемых Пользователем и реально полученных услуг<br>
           - администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами<br>
           - в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса<br>
           <br>
           Условия действия Соглашения<br>
           Данное Соглашение вступает в силу при любом использовании данного сайта.<br>
           Соглашение действует бессрочно.<br>
           Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.<br>
           При изменении соглашения, в некоторых случаях, администрация может оповестить пользователей удобным для нее способом.<br>
       </p>
    </div>
</template>

<script>
  export default {
    name: "Cookies"
  }
</script>

<style scoped lang="sass">

</style>